In [1]:
import pandas as pd

In [6]:
df1 = pd.DataFrame({'A' : [1, 2, 3], 'B' :[4, 5, 6]})
df2 = pd.DataFrame({'C' : [7, 8, 9], 'D': [10, 11, 12]})

In [7]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [8]:
df2

   C   D
0  7  10
1  8  11
2  9  12

In [9]:
pd.concat([df1, df2], axis = 0)

     A    B    C     D
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
0  NaN  NaN  7.0  10.0
1  NaN  NaN  8.0  11.0
2  NaN  NaN  9.0  12.0

In [10]:
pd.concat([df1, df2], axis = 1)

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [11]:
pd.concat([df2, df1], axis = 0)

     C     D    A    B
0  7.0  10.0  NaN  NaN
1  8.0  11.0  NaN  NaN
2  9.0  12.0  NaN  NaN
0  NaN   NaN  1.0  4.0
1  NaN   NaN  2.0  5.0
2  NaN   NaN  3.0  6.0